# Maximize3DExtents Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DatumPlane..::..Maximize3DExtents Method
DatumPlane Class See Also
---
Computes the 3d extents of all model geometry and levels, and extends the 3d extents of this datum surface to include the model extents.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void Maximize3DExtents()
```

Visual Basic
---
```text
Public Sub Maximize3DExtents
```

Visual C++
---
```text
public:
void Maximize3DExtents()
```

# Remarks
Currently does not apply to curved grids.
# See Also
DatumPlane Class
Autodesk.Revit.DB Namespace